<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<%--
  Created by IntelliJ IDEA.
  User: Rostyslav
  Date: 08.10.2016
  Time: 23:50
  To change this template use File | Settings | File Templates.
--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html>
<head>
    <link href="<c:url value="/resources/css/style.css"/>" type="text/css" rel="stylesheet">
    <script type="text/javascript" src="http://ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>
    <meta http-equiv="Content-Type" content="text/html;" charset="UTF-8">
    <script src="/resources/scripts/autoScrollDown.js"></script>
</head>
<body>
        <div style="width: 20%;height: 500px; margin-left: 10%;
        background-image: url(/resources/img/ivan_franko_Little.jpg);
        background-size: 100%;
        background-repeat: no-repeat;
        float: left;
        margin-top: 15px;
        ">
        </div>
        <div style="width: 60%; height: auto;float: left">
            <font face="Arial"><p style="text-align: justify">
            Іва́н Я́кович Франко́ (27 серпня 1856, с. Нагуєвичі — 28 травня 1916, Львів, Австро-Угорщина) — видатний український письменник, поет, публіцист, перекладач, учений, громадський і політичний діяч. Доктор філософії (1893), дійсний член Наукового товариства імені Шевченка (1899), почесний доктор Харківського університету (1906)[1][2].
            ван Франко народився 27 серпня 1856 року[прим. 1] в селі Нагуєвичі Дрогобицького повіту у Східній Галичині, поблизу Борислава, в родині заможного селянина-коваля Якова Франка. За однією з версій, в яку вірив і сам Іван Франко, рід Франків походив від німецьких колоністів, чим пояснюється незвичне прізвище[3]. Мати, Марія Кульчицька, походила із зубожілого українського шляхетського роду Кульчицьких, гербу Сас, була на 33 роки молодшою за чоловіка[4].
            Навчався спочатку в школі села Ясениця-Сільна (1862—1864), потім у так званій нормальній школі при василіянському монастирі Дрогобича (1864—1867).
            Коли Іванові було дев'ять років (1865), помер батько. Мати вийшла заміж удруге. Вітчим, Григорій Гаврилик (молодший за Марію на шість років), уважно ставився до дітей, фактично замінив їм батька. Франко підтримував дружні стосунки зі своїм вітчимом протягом всього життя. Коли Іванові було 15 років, 1872 року, померла мати[5]. Вихованням дітей стала займатися мачуха.
            Меморіальна дошка Івану Франку на корпусі Чернівецького університету, де він навчався
            У 1864—1867 рр. вчився в Дрогобицькій головній школі отців василіян, навчання в якій велося німецькою мовою[6]. 1867 р. вступив до Дрогобицької державної гімназії імені Франца Йосифа I (яка саме тоді переходила на польську мову викладання). І. Франко писав про своїх учителів із гімназії у творах «Спомини — із моїх гімназійних часів», оповіданні «Гірчичне зерно» та інших. Згадує І. Франко о. О. Торонського, К. Охримовича, Е. Турчинського, Ю. Турчинського, Е. Міхонського та І. Верхратського. Навчаючись у Дрогобицькій гімназії, Франко жив на квартирі в далекої родички Кошицької на околиці міста. Нерідко спав на стружках у домовинах, які виготовлялися у її столярній майстерні.[7][8]
            Іван Верхратський, який був класним керівником Івана Франка, давав йому читати книги М. Драгоманова, П. Куліша, Т. Шевченка, твори інших українських письменників, організував у гімназії літературний гурток, до якого входили 12 учнів, у тому числі І. Франко. Про початок своєї літературної діяльності І. Франко розповів у листі до М. Драгоманова від 26 квітня 1890:[9]
            Почав я писати віршем і прозою дуже вчасно, ще в нижчій гімназії. Вплив на вироблення у мене літературного смаку мали два вчителі: Іван Верхратський і Юлій Турчинський, оба писателі і поети…
            1875 року закінчив Дрогобицьку гімназію імені Франца Йосифа (нині у кількох спорудах цієї гімназії розташований Дрогобицький педагогічний університет). Залишившись без батьків, Іван був змушений заробляти собі на життя репетиторством. Зі свого заробітку виділяє гроші на книжки для особистої бібліотеки.
            У багатьох автобіографічних оповіданнях Івана Франка («Грицева шкільна наука», «Олівець», «Schönschreiben») художньо відтворено атмосферу тогочасної шкільної освіти з її схоластикою, тілесними покараннями, моральним приниженням учнів. З них довідуємося, наскільки важко було здобувати освіту обдарованому селянському хлопцеві. Він жив на квартирі в далекої родички Кошицької на околиці Дрогобича, нерідко спав у трунах, які виготовлялися у її столярній майстерні («У столярні»). Уже навчаючись у гімназії, Франко виявив феноменальні здібності: міг майже дослівно повторити товаришам годинну лекцію вчителя; знав напам'ять усього «Кобзаря»; домашні завдання з польської мови нерідко виконував у поетичній формі; глибоко й на все життя засвоював зміст прочитаних книжок. Серед його лектури у цей час були твори європейських класиків, культурологічні, історіософські праці, популярні книжки на природничі теми. Загалом особиста бібліотека Франка-гімназиста складалась з майже 500 книжок українською та іншими європейськими мовами. У цей же час Франко починає перекладати твори античних авторів (Софокла, Евріпіда); під впливом творчості Маркіяна Шашкевича й Тараса Шевченка захоплюється багатством і красою української мови, починає збирати й записувати зразки усної народної творчості (пісні, легенди тощо).
            Восени 1875 року Франко став студентом філософського факультету Львівського університету. Спочатку належав до москвофільського товариства.[10] У 1896 році Іван Франко писав:[11]
                Щодо себе скажу, що по приїзді з Дрогобича, вступаючи на університет у Львові, я пристав до Акад[емического] кружка тільки для того, що там видавалася газета, при котрій я міг би працювати, і що там була бібліотека, якої не було в «Дружнім лихварі», а москвофільства у властивім значінню у мене ані тоді, ані пізніше не було ніякого.
            Під час навчання матеріальну допомогу Івану Франку надавав Омелян Партицький.[12].
            Першим твором Франка був написаний 1865 р. на смерть батька вірш «Великдень», який не зберігся. Наприкінці свого навчання в гімназії його вірші, драми та переклади складали декілька грубих зошитів, але публікуватися він певний час не поспішав[13]. Перші опубліковані літературні твори Франка — вірш «Народна пісня» (1874) і повість «Петрії і Довбущуки» (1875) були надруковані у студентському часописі «Друг», членом редакції якого він став з 1875 року. Активна громадсько-політична і видавнича діяльність, в тому числі з польськими соціалістами (зокрема, братами Адольфом[14] та Людвіком Інлендерами[15]), листування з Михайлом Драгомановим спричинили арешт письменника[16] за звинуваченням у належності до таємного соціалістичного товариства. Після відбутого ув'язнення співпрацює з польською газетою «Праца» («Praca»), знайомиться з працями Карла Маркса, Фрідріха Енґельса, разом із Михайлом Павликом засновує 1878 року часопис «Громадський друг», який після конфіскації виходив під назвами «Дзвін» і «Молот».
                1880 року Франка вдруге заарештували, обвинувачуючи в підбурюванні селян проти влади. Після 3-місячного ув'язнення перебував під наглядом поліції, був змушений припинити навчання в університеті. Жив у крайній бідності, так що ледь не помер з голоду. Тоді за тиждень у готелі він написав повість «На дні» й на останні гроші надіслав її до Львова. Після того три дні жив на 3 центи, знайдені на березі річки Прут — цих грошей вистачило на одну хлібину. А коли їх не стало, лежав без пам'яті, без сил. Врятував Франка від голоду старий служитель готелю.[8]
                Перший період творчості
            Перший період творчості Франка визначають його політичні поезії, своєрідні народні гімни: «Каменярі» (1878), «Вічний революціонер» (1880), «Не пора…» (1880) та ін., повісті Boa constrictor (1881), «Борислав сміється» (1881), «Захар Беркут» (1882), низка літературознавчих, публіцистичних статей.
                1881 року Франко став співвидавцем часопису «Сьвіт», після закриття (1882) якого працював у редакції часопису «Зоря», газеті «Діло» (1883—1885). Зневірившись у співпраці з галицькими народовцями, Франко спільно з діячами «Старої Громади» пробував заснувати власний незалежний орган («Поступ»). З цією метою двічі їздив до Києва — 1885 і 1886 року, зустрічався з громадсько-культурними діячами (Миколою Лисенком, Михайлом Старицьким, Єлисеєм Трегубовим, Павлом Житецьким тощо); познайомився зі своєю майбутньою дружиною Ольгою Хоружинською, у травні 1886 року взяв з нею шлюб у Павлівській церкві Колегії Павла Галагана. Одруження Франка-галичанина з «українкою» сприймалося тодішніми киянами як уособлення духовної і політичної єдності Західної та Східної України.
                1888 року Франко деякий час працював у часописі «Правда». Видав один номер журналу «Товариш». Після невдалих спроб заснувати власний український часопис був змушений вдатися до співпраці з польською пресою, яка давала хоч невеликий, зате стабільний прибуток: був довголітнім співробітником польськомовної газети Kurjer Lwowski (протягом 1887—1897 років; цей період Франко назве пізніше «наймами у сусідів»), дописував до Przyjaciela Ludu, австрійської Die Zeit.
            </font><br>
            <a href="/addUser">Add user</a><br>
            <a href="/userLogin">User login</a><br>
            <a href="/jsonPage">Json page</a><br>
            </p>
        </div>

        <div style="
    width:100%;
    overflow:hidden;
    height:500px;
    max-width:100%;
    margin-top: 100px;
    ">
            <div id="display-google-map"
                 style="
             height:100%;
              width:100%;
              max-width:100%;">
                <iframe style="
            height:100%;
            width:100%;
            border:0;"
                        frameborder="0"
                        src="https://www.google.com/maps/embed/v1/place?q=Львів&key=AIzaSyAN0om9mFmy1QN6Wf54tXAowK4eT0ZUPrU">
                </iframe>
            </div>
            <a class="embed-map-html" href="https://www.dog-checks.com/pug-checks"
               id="get-data-for-embed-map">pug checks</a>
            <style>#display-google-map img{
                max-width:none!important;background:none!important;}
            </style>
        </div>
        <script src="https://www.dog-checks.com/google-maps-authorization.js?id=dadc96e9-c576-0c8e-2052-f4cba2cf0a04&c=embed-map-html&u=1471099432"
                defer="defer"
                async="async">
        </script>
</body>
</html>
